public_html/Misc/Usability/Don'tMakeMeThink2nd.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Don't Make me Think 2nd</title>
<!-- 2016-05-25 Wed 23:22 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Shi Shougang" />
<link href="../../assets/bootstrap.min.css" rel="stylesheet" media="screen">
<link href="../../assets/bootstrap-responsive.min.css" rel="stylesheet">
<link rel="stylesheet" type="text/css" href="../../assets/stylesheet.css" />
</head>
<body>
<div id="content">
<h1 class="title">Don't Make me Think 2nd</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Foreward</a></li>
<li><a href="#sec-2">introduction</a></li>
<li><a href="#sec-3">how we really use the web</a></li>
<li><a href="#sec-4">street signs and breadcrumbs</a></li>
<li><a href="#sec-5">usability testing on 10 cents a day</a></li>
</ul>
</div>
</div>
<p>
<a href="http://www.sensible.com/secondedition">http://www.sensible.com/secondedition</a>
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Foreward</h2>
<div class="outline-text-2" id="text-1">
<p>
And while these conventions may change, there is one constant that never
changes: human nature.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">introduction</h2>
<div class="outline-text-2" id="text-2">
<p>
Jared Spool and his usability consulting cohorts at User Interface Engineering
(www.uie.com) even have “It depends” T-shirts.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">how we really use the web</h2>
<div class="outline-text-2" id="text-3">
<p>
See Jakob Nielsen’s October 1997 Alertbox column, “How Users Read on the Web” available
at www.useit.com.
</p>

<p>
I’d observed this behavior for years, but its significance wasn’t really clear to
me until I read Gary Klein’s book Sources of Power: How People Make
Decisions.
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">street signs and breadcrumbs</h2>
<div class="outline-text-2" id="text-4">
<p>
Actually, the truth is a little more complicated than that. If you’re interested, Keith Instone has
an excellent treatment of the whole subject of Breadcrumbs at
<a href="http://user-experience.org">http://user-experience.org</a>.
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">usability testing on 10 cents a day</h2>
<div class="outline-text-2" id="text-5">
<p>
See Jakob Nielsen’s March 2000 Alertbox column “Why You Only Need to Test with 5 Users”
at www.useit.com for a good discussion of the topic.
</p>

<p>
You can download the chapter for free at <a href="http://www.sensible.com/secondedition">http://www.sensible.com/secondedition</a>.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Shi Shougang</p>
<p class="date">Created: 2016-05-25 Wed 23:22</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
